# Simple Linear Regression: Application

In this notebook, we examine how to apply simple linear regression in Python on a sample dataset containing two variables—an individual's years of experience, and their salary.

Sources:
1. <a href='https://www.udemy.com/course/machinelearning/'>Machine Learning A-Z™: Hands-On Python & R In Data Science</a>

In [16]:
# Import machine learning support
from sklearn.model_selection import train_test_split

# Import analytical libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from matplotlib import style

# Import other support
import os

## Load & Preview Data

In [3]:
# Define salary data file path
salary_data_file_path = os.path.join('Data', 'Salary_Data.csv')

# Load salary data
salary_data = pd.read_csv(salary_data_file_path)

In [15]:
# Preview data
display(salary_data.head())
display(salary_data.describe())
display(salary_data.isna().sum())

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

YearsExperience    0
Salary             0
dtype: int64

In [17]:
# Define features and labels
X = salary_data['YearsExperience'].values
y = salary_data['Salary'].values